#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_compute_network.vpc_network: Refreshing state... [id=projects/trial-cicd-a/global/networks/cicd-network]
google_cloud_run_service.api-run: Refreshing state... [id=locations/us-central1/namespaces/trial-cicd-a/services/api-run]
google_service_account.api-invoker: Refreshing state... [id=projects/trial-cicd-a/serviceAccounts/api-invoker@trial-cicd-a.iam.gserviceaccount.com]
google_compute_firewall.develop: Refreshing state... [id=projects/trial-cicd-a/global/firewalls/ssh-firewall]
google_compute_firewall.frontend: Refreshing state... [id=projects/trial-cicd-a/global/firewalls/http-firewall]
google_compute_instance.nginx_instance: Refreshing state... [id=projects/trial-cicd-a/zones/us-central1-c/instances/reverse-proxy]
google_cloud_run_service_iam_binding.invokeer: Refreshing state... [id=v1/projects/trial-cicd-a/locations/us-central1/services/api-run/roles/run.invoker]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_firewall.develop has been changed
  ~ resource "google_compute_firewall" "develop" {
        id                      = "projects/trial-cicd-a/global/firewalls/ssh-firewall"
        name                    = "ssh-firewall"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # google_compute_firewall.frontend has been changed
  ~ resource "google_compute_firewall" "frontend" {
        id                      = "projects/trial-cicd-a/global/firewalls/http-firewall"
        name                    = "http-firewall"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # google_compute_instance.nginx_instance has been changed
  ~ resource "google_compute_instance" "nginx_instance" {
        id                   = "projects/trial-cicd-a/zones/us-central1-c/instances/reverse-proxy"
      + labels               = {}
      + metadata             = {}
        name                 = "reverse-proxy"
        tags                 = [
            "dev",
            "web",
        ]
        # (13 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # google_cloud_run_service.api-run has been changed
  ~ resource "google_cloud_run_service" "api-run" {
        id       = "locations/us-central1/namespaces/trial-cicd-a/services/api-run"
        name     = "api-run"
        # (3 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (1 unchanged attribute hidden)

              ~ containers {
                  + args    = []
                  + command = []
                    # (1 unchanged attribute hidden)

                  ~ resources {
                      + requests = {}
                        # (1 unchanged attribute hidden)
                    }
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.api-run will be updated in-place
  ~ resource "google_cloud_run_service" "api-run" {
        id       = "locations/us-central1/namespaces/trial-cicd-a/services/api-run"
        name     = "api-run"
        # (3 unchanged attributes hidden)


      ~ template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                } -> null
              - generation  = 0 -> null
              - labels      = {} -> null
            }

          ~ spec {
              - container_concurrency = 80 -> null

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # google_compute_instance.decoy will be created
  + resource "google_compute_instance" "decoy" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "f1-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "decoy"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "dev",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "cicd-network"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = "TERMINATE"
          + preemptible         = true
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marltake, Action: `pull_request`, Working Directory: ``, Workflow: `terraform CI/CD`*